## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_athena_named_query.create_table_alb_logs must be replaced
-/+ resource "aws_athena_named_query" "create_table_alb_logs" {
      ~ id        = "a68277d4-9de5-465c-950a-f2daab9e12a3" -> (known after apply)
        name      = "create_table_alb_logs"
      ~ query     = <<-EOT # forces replacement
            -- Inspired from the following links:
            -- https://docs.aws.amazon.com/athena/latest/ug/application-load-balancer-logs.html
            -- https://github.com/yutachaos/terraform-aws-athena-alb-logs
            CREATE EXTERNAL TABLE IF NOT EXISTS `notification_athena.alb_logs`(
                           type string,
                           time string,
                           elb string,
                           client_ip string,
                           client_port int,
                           target_ip string,
                           target_port int,
                           request_processing_time double,
                           target_processing_time double,
                           response_processing_time double,
                           elb_status_code string,
                           target_status_code string,
                           received_bytes bigint,
                           sent_bytes bigint,
                           request_verb string,
                           request_url string,
                           request_proto string,
                           user_agent string,
                           ssl_cipher string,
                           ssl_protocol string,
                           target_group_arn string,
                           trace_id string,
                           domain_name string,
                           chosen_cert_arn string,
                           matched_rule_priority string,
                           request_creation_time string,
                           actions_executed string,
                           redirect_url string,
                           lambda_error_reason string,
                           target_port_list string,
                           target_status_code_list string,
                           classification string,
                           classification_reason string
                        )
                        PARTITIONED BY (
                           year string, month string, day string
                        )
                        ROW FORMAT SERDE 'org.apache.hadoop.hive.serde2.RegexSerDe'
                        WITH SERDEPROPERTIES (
                           'serialization.format' = '1',
                           'input.regex' =
                           '([^ ]*) ([^ ]*) ([^ ]*) ([^ ]*):([0-9]*) ([^ ]*)[:-]([0-9]*) ([-.0-9]*) ([-.0-9]*) ([-.0-9]*) (|[-0-9]*) (-|[-0-9]*) ([-0-9]*) ([-0-9]*) \"([^ ]*) ([^ ]*) (- |[^ ]*)\" \"([^\"]*)\" ([A-Z0-9-]+) ([A-Za-z0-9.-]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^\"]*)\" ([-.0-9]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^ ]*)\" \"([^\s]+?)\" \"([^\s]+)\" \"([^ ]*)\" \"([^ ]*)\"')
          -             LOCATION 's3://notification-canada-ca-staging-alb-logs/AWSLogs/239043911459/elasticloadbalancing/ca-central-1'
          +             LOCATION 's3://cbs-satellite-239043911459/lb_logs/AWSLogs/239043911459/elasticloadbalancing/ca-central-1'
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_flow_log.cloud-based-sensor will be created
  + resource "aws_flow_log" "cloud-based-sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-239043911459/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-097508d1f5e243195"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - alb_log_bucket = "notification-canada-ca-staging-alb-logs" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-sns-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
